In [4]:
import pandas as pd
import numpy as np

In [7]:
df = pd.read_csv("C:/Users/madhu/Downloads/Nameandages.csv")
df

        Name  Age
0       John   25
1      Emily   30
2    Michael   22
3      Sarah   28
4      David   35
5     Olivia   26
6     Daniel   29
7     Sophia   24
8      James   32
9   Isabella   27
10     Ethan   31
11       Ava   23
12  Benjamin   34
13       Mia   21
14   William   33

In [8]:
df.head()

      Name  Age
0     John   25
1    Emily   30
2  Michael   22
3    Sarah   28
4    David   35

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    15 non-null     object
 1   Age     15 non-null     int64
dtypes: int64(1), object(1)
memory usage: 372.0+ bytes